import React from 'react';
import Navbar from './Navbar';
import Footer from './Footer';
import styles from "../Styles/style.module.css";
const Services= () => {
    return (
        <>
        {/* <Navbar/> */}
         <img  className={styles.instimg} src='assets/instruction.png'/>
         <div className={styles.divtitle}>
         <p> تمنح منصة"<span className={styles.yellow_text}>جذور</span>"المزارع تجربة متكاملة لإدارة جميع جوانب العملية الزراعية والاستثمارية، بدءًا من إعداد الدورات الزراعية وجدولة</p>
         <p>المهام، مرورًا بالتواصل مع المستثمرين وإرسال التحديثات، وصولًا إلى الاستفادة من الذكاء الاصطناعي والتنبؤات المناخية لتحسين</p>
         <p>الإنتاجية وتعزيز الشفافية.</p>
         </div>
         <p style={{textAlign:"center",fontSize:"40px"}}><span className={styles.green_text }>خدماتنا للمزراعين</span></p>
            <div className={styles.card}>
                <div className="card" style={{ width: "50%" }}>
                    <img src="assets/cardfarmer.png" className="card-img-top" alt="farmer" />
                    <div className="card-body">
                        <p className={`card-text ${styles.cardtxt}`}>
                            <p> <span className={styles.green_text}>لتسجيل وإنشاء الحساب:</span> يمكن للمزارع إنشاء حساب جديد بسهولة على المنصة باستخدام بياناته الأساسية.</p>
                            <p> <span className={styles.green_text}>تحديث المعلومات الشخصية:</span> يمكن للمزارع تعديل بياناته الشخصية وتحديث معلومات المزرعة مثل الموقع، حجم الأرض، وتفاصيلها.</p>
                            <p> <span className={styles.green_text}>إعدادات الحساب والأمان: </span> يمكن للمزارع إدارة إعدادات الحساب، مثل تغيير كلمة المرور وتفعيل خيارات الأمان، لضمان حماية حسابه.</p>
                            <p> <span className={styles.green_text}>إدارة الدورة الزراعية:</span> إضافة دورات زراعية جديدة: تسمح المنصة للمزارع بإنشاء دورات زراعية جديدة وإضافة تفاصيل المحاصيل، وفترة الدورة، وحالة الدورة (مفتوحة للاستثمار أو مغلقة).</p>
                            <p> <span className={styles.green_text}> متابعة طلبات الاستثمار:</span>  يتيح النظام للمزارع استعراض طلبات الاستثمار المقدمة لكل دورة، ويمكنه قبول أو رفض أي طلب بناءً على الشروط المتفق عليها.</p>
                            <p><span className={styles.green_text}>عرض حالة الدورة الاستثمارية:</span>  يتمكن المزارع من معرفة عدد المستثمرين الحاليين والمبلغ المالي المجمع حتى الآن. جدولة المهام الزراعية</p>
                            <p><span className={styles.green_text}>إنشاء مهام خاصة بالدورة:</span> يتيح النظام للمزارع إنشاء قائمة بالمهام المتعلقة بالدورة مثل الري، التسميد، مكافحة الآفات، وغيرها من المهام. إشعارات المهام: يستلم المزارع إشعارات تلقائية بناءً على جدول المهام لتذكيره بالأنشطة المطلوبة.</p>
                            <p><span className={styles.green_text}>تقرير تفصيلي حول حالة المهام:</span> يقدم النظام تقارير عن حالة المهام، توضح ما إذا كانت المهام قد اكتملت بنجاح أم لا، مع تواريخ بداية ونهاية كل مهمة. الذكاء الاصطناعي لمراقبة صحة المحاصيل</p>
                            <p><span className={styles.green_text}>تحليل صحة النباتات:</span> يمكن للمزارع التقاط صور للنباتات، حيث يقوم النظام بتحليل الصور للكشف عن أي مشاكل صحية قد تواجه المحاصيل. التشخيص التلقائي للمشاكل: يقدم النظام تشخيصًا لأي مشكلة مكتشفة ويقترح حلولًا ملائمة بناءً على الذكاء الاصطناعي. مصادر الطقس.</p>
                            <p><span className={styles.green_text}>توقعات الطقس اليومية:</span> توفر المنصة تحديثات يومية عن حالة الطقس، مما يساعد المزارع على التخطيط للأنشطة الزراعية بشكل أفضل. التنبيهات المناخية: ترسل المنصة تنبيهات عند وجود تغييرات مناخية قد تؤثر على المحاصيل، مما يتيح للمزارع اتخاذ التدابير اللازمة. إدارة عمليات الدفع.</p>
                            <p><span className={styles.green_text}>إتمام الدفعات:</span> يمكن للمزارع إجراء دفعات متعلقة بالاستثمارات أو التجارة مع التجار من خلال المنصة.</p>
                            <p><span className={styles.green_text}>سجل الدفعات:</span> يحتفظ النظام بسجلات جميع العمليات المالية، مما يسهل تتبع الدفعات وإدارة الحسابات المالية. التواصل المباشر عبر الشات.</p>
                            <p><span className={styles.green_text}>نظام شات للتواصل الفوري:</span> يمكن للمزارع استخدام الشات للتواصل المباشر مع المستثمرين أو التجار لتوضيح الاستفسارات وتنسيق الاتفاقات. تحديثات دورية للمستثمرين: يستطيع المزارع إرسال تحديثات تحتوي على صور وتفاصيل حول تقدم الدورة الزراعية، مما يوفر الشفافية والمتابعة المستمرة للمستثمرين.</p>
                            <p><span className={styles.green_text}>تحديثات دورية حول تقدم المحاصيل:</span> وفر النظام للمزارع إمكانية تحميل صور ومعلومات عن نمو المحاصيل وتقدم الدورة، مما يمنح المستثمرين فرصة لمتابعة استثماراتهم عن كثب.</p>
                            <p><span className={styles.green_text}>حالة المستثمرين والمبلغ المجمع:</span> يستطيع المزارع الاطلاع على عدد المستثمرين والمبلغ المالي المجمع لكل دورة، مما يسهم في إدارة الدورة الاستثمارية بشكل أفضل. الخلاصة.</p>
                        </p>
                    </div>
                </div>
            </div>
            <div className={styles.divtitle}>
                <p> تمنح منصة"<span className={styles.yellow_text}>جذور</span>" للمستثمرين تجربة استثمارية متكاملة تتيح لهم الوصول إلى فرص استثمارية واعدة، مع تمكينهم من متابعة تقدم</p>
                <p>الدورات الزراعية، التواصل المباشر مع المزارعين، وتقديم خدمات دفع آمنة. تساعد هذه الميزات المستثمرين في اتخاذ قرارات مستنيرة</p>
                <p>وبناء علاقة شفافة مع المزارعين لضمان تحقيق عوائد مرضية من استثماراتهم.</p>
            </div>
            <p style={{textAlign:"center",fontSize:"40px"}}><span className={styles.green_text }>خدماتنا للمستثمرين</span></p>
            <div className={styles.card}>
                <div className="card" style={{ width: "50%" }}>
                    <img src="assets/cardinvestor.png" className="card-img-top" alt="farmer" />
                    <div className="card-body">
                        <p className={`card-text ${styles.cardtxt}`}>
                            <p> <span className={styles.green_text}>التسجيل كمستثمر جديد:</span> يتيح النظام للمستثمر إنشاء حساب خاص به على المنصة بسهولة.</p>
                            <p> <span className={styles.green_text}>إدارة المعلومات الشخصية:</span> يمكن للمستثمر تحديث بياناته الشخصية، مثل الاسم والبريد الإلكتروني وكلمة المرور، لضمان بقاء معلوماته محدثة. استعراض الدورات الزراعية المتاحة للاستثمار.</p>
                            <p> <span className={styles.green_text}>الوصول إلى قائمة الدورات المفتوحة: </span> يمكن للمستثمر استعراض الدورات الزراعية المفتوحة للاستثمار، حيث يمكنه الاطلاع على تفاصيل مثل نوع المحصول، موقع الأرض، والفترة الزمنية للدورة.</p>
                            <p> <span className={styles.green_text}>اختيار نوع العائد:</span> إذا كانت الدورة توفر عوائد مرنة (مالية أو نسبة من المحصول)، يمكن للمستثمر اختيار النوع الذي يفضله. تقديم طلبات الاستثمار.</p>
                            <p> <span className={styles.green_text}> تقديم طلب استثمار في دورة محددة:</span>  يمكن للمستثمر تقديم طلب استثمار في دورة زراعية، حيث يحدد المبلغ الذي يرغب في استثماره ونوع العائد الذي يفضله.</p>
                            <p><span className={styles.green_text}>تتبع حالة الطلب:</span>  يستطيع المستثمر متابعة حالة طلبه (قيد الانتظار، مقبول، مرفوض) مباشرة من خلال المنصة.</p>
                            <p><span className={styles.green_text}>معرفة عدد المستثمرين والمبلغ المجمع حاليًا:</span> يمكن للمستثمر الاطلاع على تحديثات دورية من المزارع حول نمو المحاصيل وتقدم الدورة، مثل صور المحاصيل وحالة النمو.</p>
                            <p><span className={styles.green_text}>الحصول على إشعارات بالتحديثات الجديدة:</span> عند إضافة المزارع تحديثات جديدة حول الدورة، يتلقى المستثمر إشعارًا فوريًا ليبقى على اطلاع دائم. التواصل المباشر مع المزارع.</p>
                            <p><span className={styles.green_text}>نظام شات للتواصل الفوري:</span> توفر المنصة خاصية الشات التي تسمح للمستثمر بالتواصل المباشر مع المزارع، لطرح الأسئلة أو طلب المزيد من التفاصيل حول الدورة.</p>
                            <p><span className={styles.green_text}>التفاوض على تفاصيل إضافية:</span> يمكن للمستثمر استخدام الشات لتوضيح استفسارات معينة أو طلب تفاصيل حول العوائد المتوقعة أو إدارة المخاطر. إدارة عمليات الدفع.</p>
                            <p><span className={styles.green_text}>إتمام الدفعات بأمان:</span> يمكن للمستثمر إجراء عمليات الدفع عبر المنصة بطريقة آمنة، سواء كانت الدفعة لاستثمار جديد أو تسوية مالية متعلقة بالعائدات. تتبع تاريخ الدفعات: تقدم المنصة سجلاً شاملاً للدفعات، مما يساعد المستثمر في متابعة المدفوعات السابقة وإدارة استثماراته بفاعلية. تقارير الأداء والمعلومات المالية.</p>
                            <p><span className={styles.green_text}>تقارير شاملة حول أداء الدورة:</span> يحصل المستثمر على تقارير منتظمة حول أداء الدورة والمحاصيل المزروعة، مما يساعده على تقييم العائد على الاستثمار. تفاصيل حول التكاليف والإيرادات: تشمل التقارير معلومات عن المصاريف والإيرادات، مما يعطي المستثمر صورة واضحة حول الربحية المتوقعة. الوصول إلى موارد إضافية.</p>
                            <p><span className={styles.green_text}>مصادر الطقس:</span> تقدم المنصة للمستثمرين بيانات الطقس التي قد تؤثر على المحاصيل، مما يساعدهم في متابعة المخاطر المحتملة. التقارير الشهرية والسنوية: يمكن للمستثمرين الوصول إلى تقارير إضافية تتعلق بالسوق الزراعي، مما يسهم في دعم قرارات الاستثمار. الخلاصة.</p>
                            
                        </p>
                    </div>
                </div>
            </div>
            <div className={styles.divtitle}>
                <p> تمنح منصة"<span className={styles.yellow_text}>جذور</span>"للتجار تجربة متكاملة تسهل لهم الوصول إلى المحاصيل الزراعية بجودة وشفافية عالية، مع تمكينهم من تقديم  </p>
                <p>الطلبات، التفاوض على الأسعار، وتنفيذ عمليات الدفع بأمان. من خلال هذه الميزات، يتمكن التجار من التواصل المباشر مع المزارعين </p>
                <p>وتنسيق مواعيد التسليم، مما يسهم في تحقيق شراكات تجارية مستدامة.</p>
            </div>
            <p style={{textAlign:"center",fontSize:"40px"}}><span className={styles.green_text }>خدماتنا للتجار</span></p>
            <div className={styles.card}>
                <div className="card" style={{ width: "50%" }}>
                    <img src="assets/cardmerchant.png" className="card-img-top" alt="farmer" />
                    <div className="card-body">
                        <p className={`card-text ${styles.cardtxt}`}>
                            <p> <span className={styles.green_text}>إنشاء حساب تاجر: </span> يمكن للتاجر إنشاء حساب جديد بسهولة ليتمكن من الاستفادة من المنصة.</p>
                            <p> <span className={styles.green_text}>إدارة المعلومات الشخصية والتجارية:</span> يسمح النظام للتاجر بتحديث بياناته الشخصية، مثل الاسم والبريد الإلكتروني، بالإضافة إلى معلومات النشاط التجاري مثل نوع التجارة وتفاصيل التواصل. استعراض المحاصيل المتاحة للشراء.</p>
                            <p> <span className={styles.green_text}>تفاصيل حول جودة المحاصيل وتاريخ الحصاد: </span> توفر المنصة معلومات حول حالة المحاصيل وجودتها، بما في ذلك الصور المحدثة وتاريخ الحصاد، مما يساعد التاجر على اتخاذ قرارات أفضل.</p>
                            <p> <span className={styles.green_text}>الوصول إلى قائمة المحاصيل الجاهزة للبيع:</span> يستطيع التاجر استعراض قائمة المحاصيل المتاحة التي يعرضها المزارعون للبيع، مع تفاصيل مثل نوع المحصول، الكمية المتاحة، وموقع الأرض.</p>
                            <p> <span className={styles.green_text}> تقديم طلب شراء لمحصول معين: </span>  يمكن للتاجر تقديم طلب شراء لمحصول، مع تحديد الكمية والسعر المطلوبين.</p>
                            <p><span className={styles.green_text}>التفاوض مع المزارعين:</span> يوفر النظام للتاجر إمكانية التفاوض مع المزارعين عبر نظام الشات، مما يساعدهم في الوصول إلى اتفاقيات مرضية لكلا الطرفين. التواصل المباشر مع المزارع.</p>
                            <p><span className={styles.green_text}>نظام شات للتواصل الفوري:</span> يمكن للتاجر استخدام الشات للتواصل المباشر مع المزارع، لتوضيح أي استفسارات حول المحاصيل أو لتنسيق مواعيد الاستلام.</p>
                            <p><span className={styles.green_text}>التفاوض حول تفاصيل الدفع والتسليم:</span> يتيح الشات للطرفين تحديد تفاصيل التسليم وآلية الدفع، مما يجعل عملية الشراء أكثر سلاسة.</p>
                            <p><span className={styles.green_text}>الحصول على إشعارات بالتحديثات الجديدة:</span> عند إضافة المزارع تحديثات جديدة حول الدورة، يتلقى المستثمر إشعارًا فوريًا ليبقى على اطلاع دائم. التواصل المباشر مع المزارع.</p>
                            <p><span className={styles.green_text}>إجراء الدفعات بأمان:</span> تتيح المنصة للتاجر إتمام الدفعات بشكل آمن عبر نظام الدفع المتكامل، سواء كان الدفع مقدما أو عند استلام المحصول.</p>
                            <p><span className={styles.green_text}>تتبع سجل الدفعات:</span> يوفر النظام للتاجر سجلًا لكافة الدفعات، مما يسهل عليهم إدارة سجلات الدفع والمراجعة.</p>
                            <p><span className={styles.green_text}>الحصول على إشعارات بتحديثات المحاصيل:</span>  عند إضافة المزارع تحديثات جديدة حول المحاصيل المتاحة، يتلقى التاجر إشعارًا فوريًا ليبقى على اطلاع.</p>
                            <p><span className={styles.green_text}>إضافة المحاصيل للمفضلة:</span>  يمكن للتاجر إضافة محاصيل معينة إلى قائمة المفضلة لمتابعتها بسهولة وتلقي إشعارات عن توفرها أو عند إضافة كميات جديدة.</p>
                            <p><span className={styles.green_text}>تقارير السوق الزراعي:</span> تقدم المنصة للتجار تقارير حول وضع السوق الزراعي، مما يسهم في دعم قرارات الشراء بناءً على معلومات دقيقة عن حالة العرض والطلب.</p>
                            <p><span className={styles.green_text}>توقعات الطقس:</span> يمكن للتجار الاستفادة من بيانات الطقس التي قد تؤثر على تواريخ الحصاد وتوافر المحاصيل، مما يساعدهم في التخطيط للمشتريات.</p>
                            </p>
                    </div>
                </div>
            </div>

            <Footer />
        </>
    );
};

export default Services;